Revit 2027 API
FabricationPart.ItemNumber Property
 The item number that is used for identification, re-ordering from shop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ItemNumber { get; set; }
Public Property ItemNumber As String
	Get
	Set
public:
property String^ ItemNumber {
	String^ get ();
	void set (String^ value);
}
member ItemNumber : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property:
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace